silas-wuC/Tasa-BFIC-Middleware/examples/stm32/stm32-h743-FPGA-middleware/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.h
 * @brief          : Header for main.c file.
 *                   This file contains the common defines of the application.
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2026 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32h7xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LED_GREEN_Pin GPIO_PIN_0
#define LED_GREEN_GPIO_Port GPIOB
#define MUX_SEL0_Pin GPIO_PIN_7
#define MUX_SEL0_GPIO_Port GPIOE
#define MUX_SEL1_Pin GPIO_PIN_8
#define MUX_SEL1_GPIO_Port GPIOE
#define MUX_SEL2_Pin GPIO_PIN_9
#define MUX_SEL2_GPIO_Port GPIOE
#define MUX_SEL3_Pin GPIO_PIN_10
#define MUX_SEL3_GPIO_Port GPIOE
#define MUX_SEL4_Pin GPIO_PIN_11
#define MUX_SEL4_GPIO_Port GPIOE
#define MUX_SEL5_Pin GPIO_PIN_12
#define MUX_SEL5_GPIO_Port GPIOE
#define LED_RED_Pin GPIO_PIN_14
#define LED_RED_GPIO_Port GPIOB
#define SPI1_CSB_Pin GPIO_PIN_14
#define SPI1_CSB_GPIO_Port GPIOD
#define AIP1_4_Common3_PC7_Pin GPIO_PIN_7
#define AIP1_4_Common3_PC7_GPIO_Port GPIOC
#define AIP1_4_Common2_PC8_Pin GPIO_PIN_8
#define AIP1_4_Common2_PC8_GPIO_Port GPIOC
#define AIP1_4_Common1_PC9_Pin GPIO_PIN_9
#define AIP1_4_Common1_PC9_GPIO_Port GPIOC
#define AIP1_4_Common6_PD2_Pin GPIO_PIN_2
#define AIP1_4_Common6_PD2_GPIO_Port GPIOD
#define AIP1_4_Common5_PD3_Pin GPIO_PIN_3
#define AIP1_4_Common5_PD3_GPIO_Port GPIOD
#define AIP1_4_Common4_PD4_Pin GPIO_PIN_4
#define AIP1_4_Common4_PD4_GPIO_Port GPIOD
#define LED_YELLOW_Pin GPIO_PIN_1
#define LED_YELLOW_GPIO_Port GPIOE

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
